valid_columns = [
    'field',
    'name',
    'type',
    'location',
    'owner',
    'well',
    'alt',
    'md',
    'x',
    'y'
]
float_types = ['x', 'y', 'alt', 'md']

columns = {
    'field': [
        'field',
        'месторождение',
        'мр',
        'м/р',
    ],
    'well': [
        'well',
        'скважина',
        'скв',
        'скв.',
        '№ скв.',
        '№ скв.',
        'скв.',
    ],
    'type': [
        'type',
        'тип',
        'назначение',
        'вид',
    ],
    'location': [
        'location',
        'loc',
        'область',
        'местонахождение',
        'расположение',
        'район',
    ],
    'owner': [
        'owner',
        'недропользователь',
        'заказчик',
        'компания',
    ],
    'alt': [
        'alt',
        'altitude',
        'альтитуда',
        'альт.',
        'альт',
    ],
    'md': [
        'md',
        'depth',
        'забой',
        'глубина',
    ],
    'x': [
        'x',
        'х',
    ],
    'y': [
        'y',
        'у',
    ],

}
